{
  "fully_operational_date": "2001-01-01",
  "company_info": {
    "name": "Meridian Knowledge Solutions",
    "founded_year": 1997,
    "years_in_business": 28,
    "product_name": "Meridian Learning Management System (LMS)",
    "first_customer_year": 2001
  },
  "customer_breakdown": {
    "us_federal": {
      "count": 11,
      "percentage": 16
    },
    "us_state_local": {
      "count": 33,
      "percentage": 47
    },
    "commercial": {
      "count": 26,
      "percentage": 37
    }
  },
  "marketplace_description": "Meridian LMS for Government is a secure, flexible, and scalable learning management system (LMS) purpose-built to meet the eLearning, training, compliance, and workforce development needs of government agencies and highly regulated organizations. Hosted in a secure, AWS cloud environment, Meridian supports federal, state, local, and tribal governments, and their contractors, with an enterprise-grade learning platform designed for mission-critical environments. Meridian LMS is engineered specifically to address the complexities of public sector training—including mandatory compliance tracking, role-based learning paths, and workforce readiness across distributed, security-conscious environments. It enables organizations to streamline training delivery, manage certifications, support blended learning programs, and monitor learning impact with robust, real-time reporting. Meridian LMS delivers best-of-breed built-in capabilities such as career development tools, advanced reporting, eCommerce, content partner integrations, and a native learning record store (LRS). Meridian's multi-tenant architecture offers scalability and configurability while maintaining security and data sovereignty standards expected in government operations. The platform is fully Section 508 and WCAG 2.2 compliant. Meridian Knowledge Solutions is a U.S.-based company with all development and support handled by U.S.-based personnel. In addition to its FedRAMP SaaS offering in AWS, Meridian LMS can also be deployed on-premises or in a customer’s private cloud, offering flexibility to meet diverse security and infrastructure requirements."
}
